{"relevantArticles":[{"articleTitle":"写在星火初版发布之际","articleAbstractText":"对黑客派的不满 一直以来我对黑客派都不是很满意，最近两年不满感日趋加重。不满并不是来自于功能或者界面，因为功能或者界面是可以不断调整、打磨和改进的。 对黑客派的不满主要来自于它对“社区”的实现方式是中心化的。随着我对“社区”一词的逐步理解、实践和思考，我越发感到中心化的社区实现方式是有问题的，因为这样的话黑客派其实并不是一个真正的社区，倒更像是一个开放了注册的个人博客，使用社区来形容它有挂羊头卖狗肉之嫌。 在意识到这是确实存在的一个问题后，我尝试性地做了一个修正方案，即通过“贡献系统”来实现社区自治，从而将中心化集权尽量进行分散，将一些管理权交给对黑客派有较多贡献的用户。虽然目前看来这个方案还算奏效，但却没有从根本上解决问题，因为根本问题还是来自于对社区的定义。这就好像“抽象泄露原则”所描述的那样，越是要在更高级抽象的层面解决问题，就越容易产生更多的新问题，最终，底层的基础问题将暴露无遗，浮沙高楼。 现在黑客派已经木已成舟，再怎么修整也是舟，成不了飞船了。不过即使如此，我也不会放弃的黑客派的，后面会继续尽最大努力进行调整，尽量弥补遗憾。 再识社区 社区究竟是什么？从数据、服务和系统的角....","articleStatus":0,"articlePermalink":"/articles/2019/06/04/1559578726531.html","articleImg1URL":"https://img.hacpai.com/bing/20180702.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"最近的被攻击记录","articleAbstractText":"最近几天黑客派一直在被 CC 攻击，目前是通过 IP 限制暂时解决。 从攻击客户端的 User-Agent 来看，对方的攻击手段大致是通过公有站点检查服务+肉鸡进行 CC。不过 UA 不一定准确，可能是伪造的，仅提供作为参考。 User-Agent IP 个数 Mozilla/4.0 (compatible;HostTracker/2.0;+http://www.host-tracker.com/) 90 Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1; cdnunion_monitor;) 130 Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) HeadlessChrome/62.0.3183.0 Safari/537.36 400 Mozilla/4.0 900 下面的附件是截至到今早的攻击请求日志，已经进行了 IP 去重。攻击地区主要是中国和美国，大家可以搜索一下自己的 IP 是否出现在日志中，以便做出相应的....","articleStatus":0,"articlePermalink":"/articles/2019/02/18/1550460506963.html","articleImg1URL":"https://img.hacpai.com/bing/20180912.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"是否应该让用户自己来分类内容有感","articleAbstractText":"别让普通用户做选择，不然他们会把简单的事情复杂化。对于普通用户，发布内容时功能越简单越好，甚至是只需要一个标题。不要提供分类、节点、标签的选择，因为普通用户都有“选择困难症”。 这和垃圾分类是类似的（当然，我不是说普通用户发布的内容是垃圾）。只有很少一部分人在扔垃圾时会考虑适合的垃圾桶。我们的终极社会（共产主义）实现的前提是人民的素质必须到达非常高的地步，我们理想中的社区也需要用户在很大程度上达成行为的一致和思想上的共识。 而在目前，这显然是不可能的。高速发展带来的问题主要是内部矛盾，而内部矛盾通过系统化的规则约束和引导来解决是较为稳妥和可行的。在内容分类这个问题上，我们要让一部分有强烈分类意愿的用户来达到他们对分类的渴求： 隐藏分类入口，让有探索精神的用户发现并使用它设置管理分类的权限，让具备选择能力（权限）的用户帮助其他人分类 只有这样，我们才能把社区中混乱的信息逐步进行规整，将社区的管理工作逐步交给其他参与者来做。随着管理权逐步分散执行，最终实现自治的社区。","articleStatus":0,"articlePermalink":"/articles/2019/01/06/1546744077384.html","articleImg1URL":"https://img.hacpai.com/bing/20180630.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"《提问的智慧》精读注解版","articleAbstractText":"大学期间，我看过《大教堂与集市》、《提问的智慧》以及影片《操作系统的革命》，它们对我后来的职业生涯产生了重要的影响。其中《提问的智慧》是篇长文，几十分钟就能看完，此文作者 Eric Steven Raymond（ESR）也是《大教堂与集市》的作者，著名的黑客，开源先驱。他在 2001 年第一次发布《提》后一直对此文进行着更新维护，以保证它尽量适用于最新的情况，比如与时俱进地加入新章节、修复 URL 地址、更新翻译版链接等。 今天我又读了一遍《提》，作为一个开源项目的维护者，感慨万千。下文是我对《提》的 部分 注解，如果你时间有限，可以通过该注解版进行有限的了解。但还是强烈建议你精读一遍《提问的智慧》，英语好的同学可直接看原文 How To Ask Questions The Smart Way。 下面按照原文章节进行注解，标题即原文章节标题。再次说明，我仅仅是注解了《提》中的部分内容，有时间的话请一定要看原文。 声明 该小节 ESR 建议项目维护者在用户指南文档的显著位置标注： 本指南不提供此项目的实际支持服务！ 我们已经深刻领教到少了上述声明所带来的痛苦。因为少了这点声明，我们不停.....","articleStatus":0,"articlePermalink":"/articles/2018/09/08/1536377163156.html","articleImg1URL":"https://img.hacpai.com/bing/20171127.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"社区运营阴谋论","articleAbstractText":"据我观察和猜测，某些社区是小编在运营，所谓的“内容为王”，运营者大致会干这么几件事情。 炒作热点事件：让用户觉得新奇，获得了大量“有价值”的信息从而得到满足感 开小号和用户互动：让用户觉得一切都是真实的，“不信我换个号发同样的表情给你看” 自动关注、收藏、点赞：让真实发帖者的虚荣心得到满足 删除“不良”内容、封禁“违规”账号：虽然林子大了，但不能出现这样的鸟 这些运营操作其实目的只有一个，那就是营造出价值观高度一致的氛围，让整个社区看起来欣欣向荣。 除了自身站点运营层面的操作，有些运营者甚至会在其他网站上通过小号制造网络舆论来攻击他的竞争者。运营者如果有僵尸网络（肉鸡）甚至还会发起网络攻击来干扰竞争者的网站。总之，就是想方设法让竞争者早点完蛋。 当然，以上仅是我的胡乱猜测，没有任何真凭实据，切勿相信盲从。 我什么要写这些？ 因为我曾经很多次想过这样去做运营，因为利益。这样运营是最低成本获得最大收益的方式：靠编内容能获利了为什么还要去写代码？卧槽，我好像有点傻，如此低成本高回报的事情居然不做？ 其实操作也不见得简单，因为我不会讲故事，更重要的是我认为： 资讯媒体类型的社区其实没有....","articleStatus":0,"articlePermalink":"/articles/2019/04/01/1554092922699.html","articleImg1URL":"https://img.hacpai.com/file/2019/04/timg-a2433f31.jpg?imageView2/2/w/1280/format/jpg/interlace/1"},{"articleTitle":"关于简书社区的简书钻","articleAbstractText":"简书钻 首先，这让我想起了天涯钻 :trollface: 简书钻 - 简书积分系统升级公告 - 简书 稍微再挖了几篇相关文章，大概是简书和一个叫 Fountain 的组织达成合作，通过 Fountain 的公链发币： 简书也要来区块链割韭菜吗 - 简书Fountain 白皮书 v0.95 - 简书 社区贡献的价值 简书也开始发币了，但可惜他们没有讲清楚用户最关心的事情：所谓社区贡献的价值到底是什么。 我认为简单来说，在大部分用户看来，社区贡献的价值基本等价于现实货币，也就是在平台上创作的内容是否能够变现。币圈公知李笑来曾经说过：“傻逼的共识也是共识，赚到钱就是成功”，话糙理不糙。在少部分用户（核心用户）看来，社区贡献才真正是社区产生的价值，可以在社区内通过社区币/通证的方式进行交换流通。这两者都可以看成是社区共识，也就是用户和社区达成了某种程度上价值取向的一致。 回报和增发 说回来，简书这次发币有点“作”，除了未来的价值问题没有介绍清楚外，还有个较为致命的问题：简书钻的总量上限没有公布，也就是说存在无限增发的可能。 从简书下线积分系统我基本可以断定，简书钻是无限增发的，不然....","articleStatus":0,"articlePermalink":"/articles/2018/11/09/1541729830770.html","articleImg1URL":"https://img.hacpai.com/bing/20171123.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"}]}