{"relevantArticles":[{"articleTitle":"创业的第一个夏天","articleAbstractText":"如果你是第一次看这个系列的文章，可从第一篇创业的第一个春天看起。 昆明的夏天让人感受不到热就要到秋天了，我好像又过了一个假的夏天。 BND 百度网盘不限速下载是很多人的刚需，所以 5 月初写了个小工具 BND（Baidu Netdisk Downloader），虽然有点糙但是还算好用。 BND2 计划开始社区投票了，如果你需要请前来投票。 解散 Q 群 真的很不舍啊，An 说这是“断舍离”，真是这样的。解散前夕大概十多个网友找我转让群，我都回绝了。大家主要是觉得： B3log 从此没有组织了活跃度这么高的群解散了太可惜 B3log 会一直存在下去，这是我一直以来在做的事，所以请大家放心好了。具体 Q 群解散的公告详见与此，希望大家以后将大把的时间用在处 CP、找情缘上，而不是用在装逼水群上，老群主言尽于此。 链书 年初有链书这个想法后又边做边想了小半年，6 月初上线了。对于只有程序员的项目，开发完恐怕就真的完了。但我们 B3log 不只有程序员，还有两个运营专员！ 我们会陆续上架一些书籍，大家无聊的时候记得来看看。另外，你那里如果有书籍要卖（现阶段说成是\"无偿共享\"更贴切一些），请......","articleStatus":0,"articlePermalink":"/articles/2018/07/26/1532590847178.html","articleImg1URL":"https://img.hacpai.com/bing/20181203.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"Solo 从设计到实现后记","articleAbstractText":"本文是《Solo 从设计到实现》的一个章节，该系列文章将介绍 Solo 这款 Java 博客系统是如何从无到有的，希望大家能通过它对 Solo 从设计到实现有个直观地了解、能为想参与贡献的人介绍清楚项目，也希望能为给重复发明重新定义博客系统的人做个参考 ❤️ 轮子和时间 “不要重复发明轮子”在程序员界的流行应该是从 Rod 发明 Spring 开始。他曾经在其著作《Without EJB》中使用了这个谚语，并阐述了 Spring 的诞生基于这一理念。 重复发明轮子最大的问题在于浪费时间。作为作者，浪费时间重复劳动；作为用户，浪费时间尝试。一个不好的轮子会严重浪费大家的时间，所以“不要重复发明轮子”主要针对的是那些不够圆的轮子而言。 新轮子肯定不会很圆。要么是设计问题，要么是工艺问题。设计问题最好在设计阶段就确认好，工艺问题可以花时间解决。 我觉得只要大家有时间，就尽可能发明轮子吧。无论是产品层面的优化改进，还是框架技术层面的创新尝试，我觉得都是值得的。作为普通程序员，浪费一些时间并没有什么大不了的，相信勇于尝试并坚持下去，一定能够改变一些事情的。 成功的开源 什么是成功 一个开源项目.....","articleStatus":0,"articlePermalink":"/articles/2020/02/08/1581145208243.html","articleImg1URL":"https://img.hacpai.com/bing/20190323.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"创业的第二个夏天","articleAbstractText":"如果你是第一次看这个系列的文章，可从第一篇《创业的第一个春天》1 看起。 这个夏天我开始做一些自己一直想做的事情了。 星火 做一个真正意义上的社区，这是我最近几年来最想做的一件事，通过星火已经建立了雏形。想法、认知以及如何做尽皆分享于《写在星火初版发布之际》2。 目前星火暂时只作为一个 side project，以后时间多起来的话我会把更多精力放在上面。不必纠结于理想和现实之间的选择，相信只要足够努力就一定都能实现。 Lute 千呼万唤始出来，犹抱琵琶半遮面。转轴拨弦三两声，未成曲调先有情。 7 月份整整一个月基本都在闭关修炼 Markdown 程序员之道，这条道就是做一款实现《CommonMark 规范》3 的 Markdown 引擎。在第一次学用 Markdown 时就有此想法了，今年年初的时候终于付诸于实践，建立了项目仓库开始探索，但进展一直断断续续。 年初雄心壮志，年中饱受摧残，期间重写了一遍又一遍，最终还是靠抄官方的参考实现 4 做了一版，算是渡劫失败吧。其中的曲折后面会单独写一篇分享给那些正在准备渡劫飞升的道友，祝好运 ? （2019-11-17 更新：CommonM......","articleStatus":0,"articlePermalink":"/articles/2019/08/09/1565318802920.html","articleImg1URL":"https://img.hacpai.com/bing/20190711.jpg?imageView2/2/w/1280/format/jpg/interlace/1/q/100"},{"articleTitle":"创业的第一个秋天","articleAbstractText":"如果你是第一次看这个系列的文章，可从第一篇创业的第一个春天看起。 秋天是收获的季节，但我这个码农做得不够好。 黑客派 黑客派注册数和流量还在稳定提升中，目前日 PV 20K 独立 IP 7K，靠挂广告已经能够回本服务器、带宽等费用。最近一个月 Google Adsense 广告费有小几百刀，办了个光大的卡来西联收款，不求一夜暴富，只求细水长流。在这个 IT 社区泛滥同质化严重的情况下，能收支平衡也不错了，知足常乐吧。 智能机器的 UGC 是有意义的吗？对于内容运营，我会继续坚持一直以来的观点，内容都是真实用户产生，不做“开局一个站，内容全靠编”。因为做小编太难了，我不是那块料 :joy: 链书 随着这波炒币热潮的退却，很多圈钱的项目已经套现离场。有价值的项目开始进入长跑阶段，链书虽然没有融资，但会一直坚持运营下去，不断改进优化。 对了，V 用了大概 3 天时间实现了个链书的快应用，目前已经上架了小米、 OPPO、ZET、Vivo、金立，其他手机平台也会陆续上线，大家可以在负一屏或者应用商店搜索“链书”来体验（搜不到的话过两天再试试）。另外，关于快应用简介可以看这里。 BND BND......","articleStatus":0,"articlePermalink":"/articles/2018/10/29/1540781279972.html","articleImg1URL":"https://img.hacpai.com/bing/20180501.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"开源经验谈","articleAbstractText":"Bootstrap 古话说得好：“万事开头难”。 开头在本质上是解决 “Bootstrapping”，人们一直使用这个比喻来描述解决启动问题的方法，即一个人试图用自己的鞋带将自己拉起来。比如按下电脑开机按钮后初始化系统被广泛称作自举引导（简称 booting）。 想做好一个开源项目，就先得规划一个好的启动方式。 GitHub 10 多年前做开源项目托管的话基本只有一个选择，那就是 SourceForge。期间也有过一些其他大厂的项目托管服务，比如 Google Code，Sun/Oracle 的 Project Kenai，现在都停服了。目前 GitHub 已然是全球最大的开源项目托管服务商了，促成这样现状的最大原因有这几个方面吧： git 版本控制系统的流行，并做了一些更简单的工作流，比如 Pull Request更好、更现代化的用户体验，比如 issue comments 的实时推送 API 开放平台，构建第三方应用的生态系统持续不断的改进，GitHub 隔三差五会有一些细节改进，并且桌面客户端工具也在不断演进 目前 GitHub 是开源项目托管的不二之选。国内也有类 GitHu.....","articleStatus":0,"articlePermalink":"/articles/2017/08/01/1501603146956.html","articleImg1URL":"https://img.hacpai.com/bing/20180912.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"创业的第三个春天","articleAbstractText":"如果你是第一次看这个系列的文章，可从第一《创业的第一个春天》 看起。 创业第三个年头了，娃已经长大到会问我今天还有多少 issues 没改完。 博客端 将 Solo、Pipe 完整接入社区，文章浏览计数和评论使用了社区统一提供的服务组件： uvstat：实现浏览、评论统计 vcomment：实现评论集成展现 另外，Solo 实现了静态化用法，可以生成导出静态站点，方便用户部署到 GitHub Pages 上。 笔记端 链滴笔记实现了初版，目前已经基本满足了我个人在本地 Markdown 编辑排版的需要： 有的长文需要好几天才能写完，本地陆续写好后再粘贴到线上发布。以前主要用有道云笔记，现在已经迁移到链滴笔记 记一些琐碎的记录，比如常用命令、TODO 后面我们将开始实现导出静态化站点功能，逐步集成社区，作为社区的笔记端节点。 社区端 暗黑模式 黑客派上线了暗黑模式，已经支持全部主题。具体的主题模式有三种：明亮、暗黑和随日出日落自动切换。为了“随日出日落自动切换”，我整理了中国城市经纬度数据，有需要的朋友可自取。 对于命名，之前稍微纠结过一下到底是叫“夜间模式”还是“暗黑模式”。....","articleStatus":0,"articlePermalink":"/articles/2020/04/30/1588210663196.html","articleImg1URL":"https://img.hacpai.com/bing/20200404.jpg?imageView2/2/w/1280/format/jpg/interlace/1/q/100"},{"articleTitle":"2018 成为报废程序员的第一年","articleAbstractText":"工作 第一次被裁员 2 月底云南省国资商城宣布裁员，很不幸，我和 @Vanessa 都被裁了，做扶贫的项目结果把员工给做贫了。 不过被裁也不是什么坏事，因为终于可以做自己想做的事情了！3 月份我们 建立了一家公司 —— 云南链滴科技，开启了两个程序员的创业之路。 春夏秋 创业的第一个春天创业的第一个夏天创业的第一个秋天这个冬天还没过完，明年开春前再总结 生活 旅游 7 月份沿大理-丽江-泸沽湖这条线游玩了一番，我发现我已经变成了个吃货，对景点兴趣不大，基本是走到哪里就研究那里有什么好吃的，人活一张嘴。 厨艺和散步 今年我完成了大部分的厨房灶火任务，下厨房这个 APP 还是蛮好用的，它满足了我大部分的需求，但同时我也很好奇它是怎么盈利的。可能是创业带来的影响吧，我最近总会考虑别人的赢利点，也许是潜意识中希望能借此偷来赚钱的点子吧。 每天吃完午饭，只要天气允许，我和 V 会下楼走一圈散个步，不是为了锻炼身体，而是为了讨论活下去的方法。这么说好像有点惨巴巴的，但是我们确实通过“散步讨论法”产出了好几个想做且能做的事情，当然，都是些基本没有把握能赚到钱（甚至是小钱）的事情。 这些事情可能只是.....","articleStatus":0,"articlePermalink":"/articles/2018/12/31/1546225387284.html","articleImg1URL":"https://img.hacpai.com/bing/20180617.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"}]}