{"relevantArticles":[{"articleTitle":"写在星火初版发布之际","articleAbstractText":"对黑客派的不满 一直以来我对黑客派都不是很满意，最近两年不满感日趋加重。不满并不是来自于功能或者界面，因为功能或者界面是可以不断调整、打磨和改进的。 对黑客派的不满主要来自于它对“社区”的实现方式是中心化的。随着我对“社区”一词的逐步理解、实践和思考，我越发感到中心化的社区实现方式是有问题的，因为这样的话黑客派其实并不是一个真正的社区，倒更像是一个开放了注册的个人博客，使用社区来形容它有挂羊头卖狗肉之嫌。 在意识到这是确实存在的一个问题后，我尝试性地做了一个修正方案，即通过“贡献系统”来实现社区自治，从而将中心化集权尽量进行分散，将一些管理权交给对黑客派有较多贡献的用户。虽然目前看来这个方案还算奏效，但却没有从根本上解决问题，因为根本问题还是来自于对社区的定义。这就好像“抽象泄露原则”所描述的那样，越是要在更高级抽象的层面解决问题，就越容易产生更多的新问题，最终，底层的基础问题将暴露无遗，浮沙高楼。 现在黑客派已经木已成舟，再怎么修整也是舟，成不了飞船了。不过即使如此，我也不会放弃的黑客派的，后面会继续尽最大努力进行调整，尽量弥补遗憾。 再识社区 社区究竟是什么？从数据、服务和系统的角....","articleStatus":0,"articlePermalink":"/articles/2019/06/04/1559578726531.html","articleImg1URL":"https://img.hacpai.com/bing/20180702.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"社区运营阴谋论","articleAbstractText":"据我观察和猜测，某些社区是小编在运营，所谓的“内容为王”，运营者大致会干这么几件事情。 炒作热点事件：让用户觉得新奇，获得了大量“有价值”的信息从而得到满足感 开小号和用户互动：让用户觉得一切都是真实的，“不信我换个号发同样的表情给你看” 自动关注、收藏、点赞：让真实发帖者的虚荣心得到满足 删除“不良”内容、封禁“违规”账号：虽然林子大了，但不能出现这样的鸟 这些运营操作其实目的只有一个，那就是营造出价值观高度一致的氛围，让整个社区看起来欣欣向荣。 除了自身站点运营层面的操作，有些运营者甚至会在其他网站上通过小号制造网络舆论来攻击他的竞争者。运营者如果有僵尸网络（肉鸡）甚至还会发起网络攻击来干扰竞争者的网站。总之，就是想方设法让竞争者早点完蛋。 当然，以上仅是我的胡乱猜测，没有任何真凭实据，切勿相信盲从。 我什么要写这些？ 因为我曾经很多次想过这样去做运营，因为利益。这样运营是最低成本获得最大收益的方式：靠编内容能获利了为什么还要去写代码？卧槽，我好像有点傻，如此低成本高回报的事情居然不做？ 其实操作也不见得简单，因为我不会讲故事，更重要的是我认为： 资讯媒体类型的社区其实没有....","articleStatus":0,"articlePermalink":"/articles/2019/04/01/1554092922699.html","articleImg1URL":"https://img.hacpai.com/file/2019/04/timg-a2433f31.jpg?imageView2/2/w/1280/format/jpg/interlace/1"},{"articleTitle":"是否应该让用户自己来分类内容有感","articleAbstractText":"别让普通用户做选择，不然他们会把简单的事情复杂化。对于普通用户，发布内容时功能越简单越好，甚至是只需要一个标题。不要提供分类、节点、标签的选择，因为普通用户都有“选择困难症”。 这和垃圾分类是类似的（当然，我不是说普通用户发布的内容是垃圾）。只有很少一部分人在扔垃圾时会考虑适合的垃圾桶。我们的终极社会（共产主义）实现的前提是人民的素质必须到达非常高的地步，我们理想中的社区也需要用户在很大程度上达成行为的一致和思想上的共识。 而在目前，这显然是不可能的。高速发展带来的问题主要是内部矛盾，而内部矛盾通过系统化的规则约束和引导来解决是较为稳妥和可行的。在内容分类这个问题上，我们要让一部分有强烈分类意愿的用户来达到他们对分类的渴求： 隐藏分类入口，让有探索精神的用户发现并使用它设置管理分类的权限，让具备选择能力（权限）的用户帮助其他人分类 只有这样，我们才能把社区中混乱的信息逐步进行规整，将社区的管理工作逐步交给其他参与者来做。随着管理权逐步分散执行，最终实现自治的社区。","articleStatus":0,"articlePermalink":"/articles/2019/01/06/1546744077384.html","articleImg1URL":"https://img.hacpai.com/bing/20180630.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"UGC 社区价值生态","articleAbstractText":"背景 社区是以 UGC（用户生产内容）模式下运作的，一个社区的核心资产就是用户产生的内容。高质量的内容可让社区更容易获得流量，然后通过流量变现方式进行盈利（比如广告）。 在这个生态系统中，存在几种角色： * 创作者：内容的生产者，比如帖子作者、回帖者 * 浏览者：内容的消费者，和创作者角色经常相互切换 * 社区：聚集创作者和浏览者，聚合内容，沉淀出有价值的知识 ### 价值体现 社区的核心价值在于能给创作者、浏览者带来快乐。为了达到这个目标，我想至少需要从以下几点进行努力： * 确定的受众：程序员、设计师中的高水平群体 * 极致的体验：实用、简约的界面，方便操作，稳定、高性能、安全 * 好玩的特性：比如实时交互，金融系统，思绪，小黑屋等 * 真实的成就：通过一系列数据（比如粉丝数、发帖/回帖数、浏览量、积分、创建标签数等）量化用户在社区的个人能力 * 积累与成长：用户可从高质量的内容中进行学习，同其他高水准的用户交互而获得成长，这需要我们不断积累、整理内容，并实现更科学的内容筛选机制 上面是一些这段时间对社区运营的总结，算是过往思考的一些沉淀。 ### 生态系统 前面介绍过 U....","articleStatus":0,"articlePermalink":"/articles/2016/04/30/1462028669762.html","articleImg1URL":"https://img.hacpai.com/bing/20180719.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"}]}