{"relevantArticles":[{"articleTitle":"创业的第二个春天","articleAbstractText":"如果你是第一次看这个系列的文章，可从第一篇创业的第一个春天看起。 一年过去了，计划没有变化快，而变化就是没有变化。 暂停小圆桌项目 “小圆桌”是一款面向企业的 SaaS 社区服务，之前的计划是 6 月份上线。陆续开发了一些后，我们决定暂停继续开发了。暂停开发的主要原因是我们对预期市场的不确定，或者说缺乏信心。 为了验证市场，我们开始提供 Sym 商业版云服务。因为对于客户来说并不关心云服务是如何搭建运维的，客户只关心提供的服务效果。所以我们决定先提供 Sym 商业版云服务来验证市场，如果有一定数量的企业选择云服务版的社区，那就可以说明面向企业的 SaaS 社区是有市场的，那时候再重新启动小圆桌项目。 很多成功的商业是预先判断市场、超前时代的。可惜我没有那样的能力和实力，只能就眼目前的情况来做出一些短期选择。如果我和 V 还在上班而不是自己创业，小圆桌作为一个 side project 的话是绝对要去实现上线的，因为我觉得真的值得一试。 暂停对个人出售 Sym 商业版 之前 Sym 商业版是对个人出售的，并且价格仅是对企业售价的 5 折。直到上个月我发现了一件令我非常沮丧的事情，就是有.....","articleStatus":0,"articlePermalink":"/articles/2019/04/23/1555989598304.html","articleImg1URL":"https://img.hacpai.com/bing/20190406.jpg?imageView2/2/w/1280/format/jpg/interlace/1/q/100"},{"articleTitle":"2018 成为报废程序员的第一年","articleAbstractText":"工作 第一次被裁员 2 月底云南省国资商城宣布裁员，很不幸，我和 @Vanessa 都被裁了，做扶贫的项目结果把员工给做贫了。 不过被裁也不是什么坏事，因为终于可以做自己想做的事情了！3 月份我们 建立了一家公司 —— 云南链滴科技，开启了两个程序员的创业之路。 春夏秋 创业的第一个春天创业的第一个夏天创业的第一个秋天这个冬天还没过完，明年开春前再总结 生活 旅游 7 月份沿大理-丽江-泸沽湖这条线游玩了一番，我发现我已经变成了个吃货，对景点兴趣不大，基本是走到哪里就研究那里有什么好吃的，人活一张嘴。 厨艺和散步 今年我完成了大部分的厨房灶火任务，下厨房这个 APP 还是蛮好用的，它满足了我大部分的需求，但同时我也很好奇它是怎么盈利的。可能是创业带来的影响吧，我最近总会考虑别人的赢利点，也许是潜意识中希望能借此偷来赚钱的点子吧。 每天吃完午饭，只要天气允许，我和 V 会下楼走一圈散个步，不是为了锻炼身体，而是为了讨论活下去的方法。这么说好像有点惨巴巴的，但是我们确实通过“散步讨论法”产出了好几个想做且能做的事情，当然，都是些基本没有把握能赚到钱（甚至是小钱）的事情。 这些事情可能只是.....","articleStatus":0,"articlePermalink":"/articles/2018/12/31/1546225387284.html","articleImg1URL":"https://img.hacpai.com/bing/20180617.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"创业的第二个秋天","articleAbstractText":"如果你是第一次看这个系列的文章，可从第一篇《创业的第一个春天》1 看起。 帮助别人成功，自己才有成功的机会。 Vditor &amp; Lute 这个秋天开始实现 Vditor 的“所见即所得”特性，即实现 Typora2 那样写 Markdown 时不用分屏预览，而是边写边渲染。不过 Markdown 本身的设计用意就是“所见即所得”，所以把这个特性叫做“实时渲染”更恰当一些。这个月应该能实现完，下个月正式发布。 技术方案上我们是通过让 Lute 支持渲染“Vditor DOM”来实现。这个方案最难的部分莫过于实现源码映射3，即渲染结果字符和 Markdown 原文字符的位置对应关系。只有实现了源码映射才能实现编辑（光标）位置的正确移动。完整方案和技术细节后续会单独写一篇文档来介绍，希望能给其他在做 Markdown 编辑器的开发者带来帮助。 Latke Latke 是我们 Java 产品线的开发框架，之前的 Latke 是基于 Servlet 实现的，虽然能用但是一直不太满意： Servlet 有点重，很多特性用不上 性能不足够好 不同的 Servlet 容器有不同的部署细节，......","articleStatus":0,"articlePermalink":"/articles/2019/11/11/1573402018349.html","articleImg1URL":"https://img.hacpai.com/bing/20191024.jpg?imageView2/2/w/1280/format/jpg/interlace/1/q/100"},{"articleTitle":"创业的第三个春天","articleAbstractText":"如果你是第一次看这个系列的文章，可从第一《创业的第一个春天》 看起。 创业第三个年头了，娃已经长大到会问我今天还有多少 issues 没改完。 博客端 将 Solo、Pipe 完整接入社区，文章浏览计数和评论使用了社区统一提供的服务组件： uvstat：实现浏览、评论统计 vcomment：实现评论集成展现 另外，Solo 实现了静态化用法，可以生成导出静态站点，方便用户部署到 GitHub Pages 上。 笔记端 链滴笔记实现了初版，目前已经基本满足了我个人在本地 Markdown 编辑排版的需要： 有的长文需要好几天才能写完，本地陆续写好后再粘贴到线上发布。以前主要用有道云笔记，现在已经迁移到链滴笔记 记一些琐碎的记录，比如常用命令、TODO 后面我们将开始实现导出静态化站点功能，逐步集成社区，作为社区的笔记端节点。 社区端 暗黑模式 黑客派上线了暗黑模式，已经支持全部主题。具体的主题模式有三种：明亮、暗黑和随日出日落自动切换。为了“随日出日落自动切换”，我整理了中国城市经纬度数据，有需要的朋友可自取。 对于命名，之前稍微纠结过一下到底是叫“夜间模式”还是“暗黑模式”。....","articleStatus":0,"articlePermalink":"/articles/2020/04/30/1588210663196.html","articleImg1URL":"https://img.hacpai.com/bing/20200404.jpg?imageView2/2/w/1280/format/jpg/interlace/1/q/100"},{"articleTitle":"创业的第一个秋天","articleAbstractText":"如果你是第一次看这个系列的文章，可从第一篇创业的第一个春天看起。 秋天是收获的季节，但我这个码农做得不够好。 黑客派 黑客派注册数和流量还在稳定提升中，目前日 PV 20K 独立 IP 7K，靠挂广告已经能够回本服务器、带宽等费用。最近一个月 Google Adsense 广告费有小几百刀，办了个光大的卡来西联收款，不求一夜暴富，只求细水长流。在这个 IT 社区泛滥同质化严重的情况下，能收支平衡也不错了，知足常乐吧。 智能机器的 UGC 是有意义的吗？对于内容运营，我会继续坚持一直以来的观点，内容都是真实用户产生，不做“开局一个站，内容全靠编”。因为做小编太难了，我不是那块料 :joy: 链书 随着这波炒币热潮的退却，很多圈钱的项目已经套现离场。有价值的项目开始进入长跑阶段，链书虽然没有融资，但会一直坚持运营下去，不断改进优化。 对了，V 用了大概 3 天时间实现了个链书的快应用，目前已经上架了小米、 OPPO、ZET、Vivo、金立，其他手机平台也会陆续上线，大家可以在负一屏或者应用商店搜索“链书”来体验（搜不到的话过两天再试试）。另外，关于快应用简介可以看这里。 BND BND......","articleStatus":0,"articlePermalink":"/articles/2018/10/29/1540781279972.html","articleImg1URL":"https://img.hacpai.com/bing/20180501.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"},{"articleTitle":"创业的第二个冬天","articleAbstractText":"如果你是第一次看这个系列的文章，可从第一篇《创业的第一个春天》[^1] 看起。 认真积累，别走捷径。 CDN 盗刷 12 月份的某天，社区的 CDN 图床被人恶意刷了好几十 G 流量，虽然造成的损失就几十块钱，但我觉得这不是钱的问题，而是对我技术能力的嘲讽。通过分析日志，基本可以判断攻击来源是类似基于 Electron、Headless Chrome 的应用，因为这些攻击流量的来源 IP 大部分不是来自机房服务器。 随后我们通过七牛云提供的“回源鉴权”机制解决了这个问题，所有对图床 CDN 的请求都需要鉴权。判断依据是通过 Referer、IP，大致规则是禁止为空的 Referer，并且 IP 不能来自机房。顺手也加了防盗链，综合了博客端节点（Solo、Pipe）回调接口来判断请求是否是博客端发起的。 后来攻击者发现我们的应对措施后，就将流量转移到了攻击博客端节点，一些用户的博客被恶意请求，请求并不密集，攻击者企图慢慢消耗社区图床 CDN 以造成损失。这部分攻击流量后来也通过限流算法做了判断，最终将不合法的 IP 加入到社区 IP 黑名单[^2]中，博客端节点会定时获取这份黑名单列表.....","articleStatus":0,"articlePermalink":"/articles/2020/02/09/1581219038316.html","articleImg1URL":"https://img.hacpai.com/bing/20200209.jpg?imageView2/2/w/1280/format/jpg/interlace/1/q/100"},{"articleTitle":"2019 用善意面对世界","articleAbstractText":"春夏秋 春、夏、秋。 明年就是《创》的第三年了，也将是最后一年更新该系列了，以后不定时有感随发。 Vditor 今年我和 V 主要精力花在了构建 Vditor 上，我们没有选择基于其他编辑器内核来做，而是从零开始写，包括 Markdown 解析渲染也撸了一遍，整个实现基本没有第三方依赖（除了支持图表、数学公式等）。 对于大部分开发者来说，提供给用户使用的编辑器是能用就凑合着用，因为编辑器候选品不多，自己造轮子的话工作量不小，即使碰到有需要更改的地方也有办法： 通过编辑器本身的扩展机制 在生成的 HTML 上再做处理 直接改编辑器项目源码 办法是有，修修补补也能用。但如果要追求更好的用户体验那就只能自己写一个了。 另外，我们观察到一个现象，比较成功的 UGC 社区都有自己的编辑器。因为内容源是用户创造的，编辑器是否好用会对创作过程产生很大影响，所以编辑器可以说是 UGC 社区的核心之一。 Vditor 起初的定位是 Markdown 编辑器，我们已经在 v1 中达到了业界主流水准，即分屏编辑预览。v2 中我们改变了定位：“所见即所得，支持 Markdown”，这样 Vditor 将更......","articleStatus":0,"articlePermalink":"/articles/2019/12/30/1577712379212.html","articleImg1URL":"https://img.hacpai.com/bing/20180421.jpg?imageView2/1/w/1280/h/720/interlace/1/q/100"}]}